#Область ОбработчикиСобытий
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("ДействуетНаОсновании");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ФИО = Данные.Наименование;
	ДействуетНаОсновании = Данные.ДействуетНаОсновании;
	Если ЗначениеЗаполнено(ДействуетНаОсновании) Тогда
		Представление = ФИО + " (" + ДействуетНаОсновании + ")";
	Иначе
		Представление = ФИО;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти