#Область ПрограммныйИнтерфейс

Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	// ДИМИТРУК Н. КОНТАКТНОЕ ЛИЦО - для всех документов
	Если СтрНачинаетсяС(ИмяФормы, "Документ.") И СтрЗаканчиваетсяНа(ИмяФормы, ".Форма.ФормаДокумента") Тогда
		ДобавитьКонтактноеЛицо(Форма);
	КонецЕсли;
	// ДИМИТРУК Н. Конец. КОНТАКТНОЕ ЛИЦО - для всех документов
КонецПроцедуры

#КонецОбласти
	
#Область СлужебныйПрограммныйИнтерфейс 
 
Процедура ДобавитьКонтактноеЛицо(Форма)
	// ДИМИТРУК Н. КОНТАКТНОЕ ЛИЦО - для всех документов
	Если Форма.Элементы.Найти("КонтактноеЛицо") = Неопределено Тогда
		ПолеДоговор = Форма.Элементы.Договор; 
		Родитель = ПолеДоговор.Родитель;
		
		ПолеКонтактноеЛицо = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), Родитель);
		ПолеКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
		ПолеКонтактноеЛицо.ПутьКДанным = "Объект.КонтактноеЛицо";
		ПолеКонтактноеЛицо.Заголовок = "Контактное лицо:";
	КонецЕсли;
	// ДИМИТРУК Н. Конец. КОНТАКТНОЕ ЛИЦО - для всех документов
КонецПроцедуры
#КонецОбласти