#Область ПрограммныйИнтерфейс

Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
// ДИМИТРУК Н. КОНТАКТНОЕ ЛИЦО - для всех документов
	Если СтрНачинаетсяС(ИмяФормы, "Документ.") И СтрЗаканчиваетсяНа(ИмяФормы, ".Форма.ФормаДокумента") Тогда
		ДобавитьКонтактноеЛицо(Форма);
	КонецЕсли;
// ДИМИТРУК Н. Конец. КОНТАКТНОЕ ЛИЦО - для всех документов
	
// ДИМИТРУК Н. СОГЛАСОВАННАЯ СКИДКА И КНОПКА - только для заказа покупателя
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьСогласованнуюСкидку(Форма);
	КонецЕсли;
// ДИМИТРУК Н. Конец. СОГЛАСОВАННАЯ СКИДКА И КНОПКА - для всех документов
	
КонецПроцедуры

#КонецОбласти
	
#Область СлужебныйПрограммныйИнтерфейс 
 
Процедура ДобавитьКонтактноеЛицо(Форма)
	// ДИМИТРУК Н. КОНТАКТНОЕ ЛИЦО - для всех документов
	Если Форма.Элементы.Найти("КонтактноеЛицо") = Неопределено Тогда
		ПолеДоговор = Форма.Элементы.Договор; 
		Родитель = ПолеДоговор.Родитель;
		
		ПолеКонтактноеЛицо = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), Родитель);
		ПолеКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
		ПолеКонтактноеЛицо.ПутьКДанным = "Объект.КонтактноеЛицо";
		ПолеКонтактноеЛицо.Заголовок = "Контактное лицо:";
	КонецЕсли;
	// ДИМИТРУК Н. Конец. КОНТАКТНОЕ ЛИЦО - для всех документов
КонецПроцедуры

Процедура ДобавитьСогласованнуюСкидку(Форма)
	
	// ДИМИТРУК Н. СОГЛАСОВАННАЯ СКИДКА 
	Если Форма.Элементы.Найти("СогласованнаяСкидка") = Неопределено Тогда
		ПолеОрганизация = Форма.Элементы.Организация;
		Родитель = ПолеОрганизация.Родитель;
		
		ПолеСкидка = Форма.Элементы.Вставить("СогласованнаяСкидка", Тип("ПолеФормы"), Родитель);
		ПолеСкидка.Вид = ВидПоляФормы.ПолеВвода;
		ПолеСкидка.ПутьКДанным = "Объект.СогласованнаяСкидка";
		ПолеСкидка.Заголовок = "Согласованная скидка:";
		
		ПолеСкидка.УстановитьДействие("ПриИзменении", "СогласованнаяСкидкаПриИзмененииПосле");
	КонецЕсли;
	// ДИМИТРУК Н. Конец. СОГЛАСОВАННАЯ СКИДКА 
	
КонецПроцедуры

#КонецОбласти